{
  "a propos": {
    "explanations": [
      "'A propos' jest sformułowaniem, które wprowadzane jest do wypowiedzi w momencie, w którym coś sobie przypomnimy. To wtrącenie oznacza 'w związku z lub o czymś, na marginesie, przy okazji'. W polszczyźnie jest to również wyrażenie wprowadzające temat wypowiedzi.",
      "Pisownię łączną wyjaśnia etymologia. Wyraz ten pochodzi z języka francuskiego, w którym oznacza wykrzyknienie 'O!'. W oryginalnej pisowni występuje również akcent nad samogłoską 'a' - 'à propos'. Natomiast błędny zapis 'apropo' wynika z francuskiej wymowy."
    ],
    "search_rule": "\\b(apropo(s|)|a propo)\\b"
  },
  "będę": {
    "explanations": [
      "'Będę' to czasownik w 1 osobie liczby pojedynczej. Pochodzi od bezokolicznika być. Oznacza trwanie, istnienie, obecność lub bycie w określonym miejscu. Poprawna forma zapisu to 'będę' z użyciem 'ę' w środku i na końcu wyrazu. Błędny zapis może wynikać z wymowy, w której 'ę' traci nosowość."
    ],
    "search_rule": "\\bbende\\b"
  },
  "co najmniej": {
    "explanations": [
      "Zgodnie z zasadami ortografii języka polskiego 'co najmniej' powinniśmy zapisywać osobno, oddzielając partykułę wzmacniającą 'co' od przysłówka 'najmniej'. Nakazuje to reguła mówiąca, że poszczególne człony wyrażenia zaimkowego, czyli połączenia zaimka i następującej po nim innej części mowy, piszemy rozdzielnie."
    ],
    "search_rule": "\\bconajmniej\\b"
  },
  "dlatego że": {
    "explanations": [
      "Poprawnym zapisem jest forma 'dlatego że', ponieważ jest to spójnik składający się z dwóch nierozłącznych spójników, które razem tworzą całość znaczeniową. 'Dlatego bo' jest niepoprawne ze względu na podkreślenie relacji przyczynowej, które wyraża zarówno 'dlatego', jak i 'bo', a więc są synonimami, zaś całe wyrażenie 'dlatego bo' jest pleonazmem (czyli na przykład jak 'masło maślane'). Przecinek umieszczamy najczęściej przed całym spójnikiem złożonym 'dlatego że'."
    ],
    "search_rule": "\\bdlatego[,]{0,1} bo\\b"
  },
  "dopóki": {
    "explanations": [
      "'Dopóki' należy do wyrażeń przyimkowych, które we współczesnej polszczyźnie przekształciły się we zrosty. Takie konstrukcje, niezależnie od uwarunkowań historycznych, zapisuje się zawsze łącznie."
    ],
    "search_rule": "\\b(do p[ou]ki|dopuki)\\b"
  },
  "dzień dzisiejszy": {
    "explanations": [
      "Połączenie 'w dniu dzisiejszym' jest nacechowane oficjalnością i pojawić się może jedynie w tekstach oficjalnych i urzędowych, choć nie można zapomnieć, że słowniki poprawnej polszczyzny przestrzegają przed konstrukcją 'dzień dzisiejszy', która jest nadużywana właśnie w wypowiedziach utrzymanych w stylu oficjalnym i urzędowym. Przysłówki dzisiaj i dziś są wyrazami o znaczeniu neutralnym, są zatem poprawne w każdym tekście."
    ],
    "search_rule": "\\b(dniu|dzien) (dzisiejszy|jutrzejszy|wczorajszy)[m]{0,1}\\b"
  },
  "in vitro": {
    "explanations": [
      "'In vitro' wywodzi się z języka łacińskiego, gdzie dosłownie tłumaczone jest jako 'w szkle'. Składa się z przyimka 'in' oraz rzeczownika 'vitro', stąd polszczyzna przejęła zapis rozłączny."
    ],
    "search_rule": "\\bin[vw]itro\\b"
  },
  "już": {
    "explanations": [
      "Poprawną pisownię wyjaśnia etymologia. Dzisiejsze 'już' jest skróconą formą staropolskiego 'juże', a więc zapis z użyciem 'ż' jest uwarunkowany historycznie."
    ],
    "search_rule": "\\bjusz\\b"
  },
  "na co dzień": {
    "explanations": [
      "Zapis rozłączny 'na co dzień' określa zasada konwencjonalna. Oznacza to, że przyjętej pisowni nie rozstrzyga ani wymowa, ani pochodzenie historyczne. Warto jednak zwrócić uwagę na budowę tego wyrażenia: 'na' jest przyimkiem, który bardzo często wchodzi w skład wyrażeń przyimkowych, jakie zawsze zapisujemy rozłącznie. Natomiast 'co dzień' należy do wyrażeń zaimkowych również pisanych rozłącznie. Zatem każdy element tej frazy musi zostać zapisany oddzielnie. Błędne 'nacodzień' wynika najpewniej z analogii do 'codziennie', jednak rozkład części mowy wskazuje, że są to trzy osobne wyrazy."
    ],
    "search_rule": "\\bna[ ]{0,1}codzien\\b"
  },
  "na pewno": {
    "explanations": [
      "Wyrażenie 'na pewno' wywodzi się od prasłowiańskiej formy przymiotnika rodzaju nijakiego 'pewno'. Zarówno w przypadku tego sformułowania, jak i podobnych: na lewo, na prawo, na okrągło, na nowo, obowiązuje pisownia rozdzielna."
    ],
    "search_rule": "\\bnapewno\\b"
  },
  "na prawdę": {
    "explanations": [
      "'Naprawdę' pisane łącznie to partykuła, za pomocą której możemy kogoś przekonać, że mamy rację, i potwierdzić prawdziwość tego, co mówimy, np. 'Naprawdę byłam wczoraj w domu i nigdzie nie wychodziłam'",
      "Przy użyciu 'naprawdę' możemy także wyrazić niedowierzanie lub zdziwienie, np. 'Nie wierzę, że naprawdę to powiedziałaś.'",
      "Zapis 'na prawdę' zastosujemy wyłącznie w przypadkach, gdy mowa o rzeczowniku 'prawda' w bierniku liczby pojedynczej ('prawdę') zestawionym z przyimkiem 'na'."
    ],
    "search_rule": "\\bna prawde\\b"
  },
  "na razie": {
    "explanations": [
      "Wyrażenie przyimkowe 'na razie', pełniące funkcje przysłówka, używamy w znaczeniu: tymczasem, teraz, jeszcze. Jest to również potoczna formuła pożegnalna. W obu powyższych znaczeniach poprawny jest rozdzielny zapis."
    ],
    "search_rule": "\\bnarazie\\b"
  },
  "naprzeciwko": {
    "explanations": [
      "Niegdyś 'naprzeciwko' było połączeniem przyimkowym. We współczesnej polszczyźnie funkcjonuje jako zrost wyrazów 'na' i 'przeciw'. Takie konstrukcje zawsze zapisywane są łącznie."
    ],
    "search_rule": "\\bna przeciw(ko|)\\b"
  },
  "nie wiem": {
    "explanations": [
      "Zgodnie z obowiązującymi w języku polskim zasadami ortograficznymi partykułę nie będącą wykładnikiem zaprzeczenia piszemy rozdzielnie przed czasownikami."
    ],
    "search_rule": "\\bniewiem\\b"
  },
  "notabene": {
    "explanations": [
      "'Notabene' to w języku polskim wyraz wtrącony w tekst zdania, który poprzedza dodatkową, ale ważną informację. Chociaż jego pisownia w języku łacińskim była oddzielna – 'nota bene', czyli 'zauważ dobrze', w polszczyźnie od wielu lat obowiązuje zapis łączny. Wyrażenie to jest bowiem traktowane jako wyraz złożony."
    ],
    "search_rule": "\\bnota bene\\b"
  },
  "okres": {
    "explanations": [
      "'Okres czasu' jest formą niepoprawną, ponieważ wyrażenie to należy do pleonazmów, czyli 'masła maślanego', w którym oba człony oznaczają to samo. Okres, czyli czas trwania czegoś, odcinek, zatem nie ma potrzeby dodawania do niego określenia 'czas'."
    ],
    "search_rule": "\\bokres(|u|owi|em|ie) czasu\\b"
  },
  "poza tym": {
    "explanations": [
      "Wyrażenie przyimkowe 'poza tym' - będące partykułą wprowadzającą nowe informacje do wypowiedzi – zapisujemy, rozdzielając przyimek 'poza' od zaimka wskazującego 'tym'. Niedopuszczalna jest zarówno pisownia rozdzielna przybierająca formę: 'po za tym', jak również pisownia łączna: 'pozatym' (wzorująca się zapisie wyrazu 'ponadto')."
    ],
    "search_rule": "\\b(po za tym|pozatym)\\b"
  },
  "rządzić": {
    "explanations": [
      "'Rządzić' to sprawować rządy, stać na czele, posiadać władzę, mieć wpływy. O 'rządzić' zapisywanym z użyciem 'rz' pisał już w 1927 roku Aleksander Brückner w Słowniku etymologicznym języka polskiego. Ponadto 'rządzić' było znane już w staropolszczyźnie pod postacią 'riad'. Oznacza to więc, że zapis z użyciem 'rz' jest motywowany historycznie."
    ],
    "search_rule": "\\bzadz(e|isz|i|imy|icie|a)\\b"
  },
  "sprzed": {
    "explanations": [
      "Przyimek 'spod' i przyimek 'sprzed' zawsze piszemy łącznie i przez 's-'. Nie ma takiego kontekstu, w których mogło by zostać uznane za poprawne napisanie 'z pod' lub 'z przed'. Od 1936 roku, czyli od czasu reformy ortografii, przyimki 'spod' i 'sprzed' są zrostami i należy je zapisywać łącznie."
    ],
    "search_rule": "\\bz[ ]{0,1}(przed|pod)\\b"
  },
  "szedłem": {
    "explanations": [
      "Formy 'szedłem', 'poszedłem', 'doszedłem' są zgodne z systemem gramatycznym polszczyzny, a formy 'szłem', 'poszłem', 'doszłem' są niepoprawne. Skoro mówimy: 'on szedł', na nie: on 'szł', to poprawnie mówimy i piszemy również: 'ja szedłem'."
    ],
    "search_rule": "\\b(do|wy|p(o|rzy)){0,1}szlem\\b"
  },
  "w ogóle": {
    "explanations": [
      "Wyrażenie przyimkowe 'w ogóle' piszemy rozdzielnie. Podobnie jak 'na ogół' i 'z ogółem'. Wszystkie bowiem pochodzą od rzeczownika 'ogół'."
    ],
    "search_rule": "\\bwog[ou]le\\b"
  },
  "wziąć": {
    "explanations": [
      "Jedyną dozwoloną jest 'wziąć'. W wielu przypadkach 'wziąść' tworzone jest przez podobieństwo do innych czasowników zakończonych na '-ść', takich jak: 'pójść' czy 'usiąść'. Aby ułatwić zapamiętanie tej formy, polecam skojarzenie z czasownikiem 'brać': 'wziąć', a nie 'wziąść', bo nie można czegoś 'braść'."
    ],
    "search_rule": "\\bwzia[sz]c\\b"
  },
  "z powrotem": {
    "explanations": [
      "Zgodnie z zasadami języka polskiego wyrażenie 'z powrotem' powinniśmy zapisać rozdzielnie z przyimkiem 'z'. Nietrudno w tym przypadku o pomyłkę. Część wyrażeń pisanych etymologicznie osobno (reguła obowiązywała do 1938 roku) zgodnie z obowiązującymi zasadami zapisuje się łączenie w takiej postaci: 'sponad' dawniej: 'z ponad' 'sprzed' dawniej: 'z przed'. Jednak wyrażenie 'z powrotem' nie zmieniło swojej formy."
    ],
    "search_rule": "\\b[sz]powrotem\\b"
  },
  "złodziei": {
    "explanations": [
      "Prawidłowa pisownia tego rzeczownika to 'złodziei'. Błędny zapis wynika z analogii do reguły ortograficznej mówiącej, że po samogłoskach pisane jest 'j', oraz wymowy, gdzie 'j' jest wyraźnie słyszane ze względu na uproszczenia w artykulacji."
    ],
    "search_rule": "\\bzlodzieji\\b"
  }
}
